Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: This document describes differences between the 5.8.0 release and the 5.9.0 release.
es_es: Este documento describe las diferencias entre la versión 5.8.0 y la versión 5.9.0.

source: An C<our> declaration may also have a list of attributes associated with it.
es_es: Una declaración C<our> también puede tener una lista de atributos asociados a ella.

source: In particular with GCC-2.7.2.x accept all the defaults and *watch* out for the message:
es_es: En particular, con GCC-2.7.2.x acepte todos los valores por defecto, y *busque* por el siguiente mensaje:

source: Something like a UUCP or PPP chat script or an expect script fits the bill nicely, as do configuration scripts run by a program at its start up, such F<.cshrc> or F<.ircrc>, for example.
es_es: Algo como un script de chat UUCP o PPP, o un script de automatización con la utilidad expect, se ajusta muy bien a esta definición, igual que los scripts de configuración ejecutados en el inicio de un programa, como F<.cshrc> o F<.ircrc>, por ejemplo.

source: Check the documentation on an individual feature to verify its current status.
es_es: Consulte la documentación de cada característica individual para verificar su estado actual.

source: while (<$in>) { # assigns each line in turn to $_
es_es: while (<$entrada>) { # asigna una línea cada vez a $_

source: You write C</>I<sequence-item> and the repeat count is obtained by popping off the last element from the stack.
es_es: Escriba C</>I<secuencia-item> y el contador de repeticiones se obtiene extrayéndolo del último elemento de la pila.

source: ($login, $passwd, $remainder) = split(/:/, $_, 3);
es_es: ($login, $contraseña, $resto) = split(/:/, $_, 3);

source: BEGIN { require Module }
es_es: BEGIN { require Módulo }

source: (This doesn't apply to sysread() and syswrite().)
es_es: (esto no se aplica a sysread() ni a syswrite()).

source: You can use the defined() operator to determine whether a scalar value is defined (this has no meaning on arrays or hashes), and the undef() operator to produce an undefined value.
es_es: Se puede usar el operador defined() para determinar si un valor escalar está definido (esto no tiene significado si se aplica a arrays o hashes), y el operador undef() para producir un valor no definido.

source: =head2 New Core Modules
es_es: =head2 Nuevos módulos principales

source: For each such format, pack() generates 4 bits of result.
es_es: Para cada formato así, pack() genera 4 bits del resultado.

source: For example: C<< ^(?>a*)ab >> will never match, since C<< (?>a*) >> (anchored at the beginning of string, as above) will match I<all> characters C<a> at the beginning of string, leaving no C<a> for C<ab> to match.
es_es: Por ejemplo: C<< ^(?>a*)ab >> nunca coincidirá, ya que C<< (?>a*) >> (anclada al comienzo de la cadena, como antes) encontrará I<todos> los caracteres C<a> al comienzo de la cadena, sin dejar ninguna otra para C<ab>.

source: There is no syseof() function, which is ok, since eof() doesn't work well on device files (like ttys) anyway.
es_es: No hay función syseof(), que está bien, ya que, de todos modos, eof() no funciona bien con los archivos de dispositivo (como los ttys).

source: Otherwise, C</a> behaves like the C</u> modifier, in that case-insensitive matching uses Unicode semantics; for example, "k" will match the Unicode C<\N{KELVIN SIGN}> under C</i> matching, and code points in the Latin1 range, above ASCII will have Unicode rules when it comes to case-insensitive matching.
es_es: De lo contrario, C</a> se comporta como el modificador C</u>, en que la comparación que no distingue entre mayúsculas y minúsculas utiliza semántica Unicode; por ejemplo, "k" coincidirá con el Unicode C<\N{KELVIN SIGN}> bajo C</i>, y los puntos de código en el rango de Latin1, por encima de ASCII tendrá reglas Unicode cuando se trata de coincidencias que no distingan entre mayúsculas y minúsculas.

source: See L<< UNIVERSAL/"$obj->DOES( ROLE )" >>.
es_es: Vea L<< UNIVERSAL/"$obj->DOES( ROL )" >>.

# $_ = 'xyz'; print $x," "; # prints 1xyz4
source: $_ = 'xyz'; print $x,"\n"; # prints 1xyz4
es_es: $_ = 'xyz'; print $x,"\n"; # imprime 1xyz4

source: The Math::Complex module (part of the standard perl distribution) defines mathematical functions that work on both the reals and the imaginary numbers.
es_es: El módulo Math::Complex (parte de la distribución estándar de Perl) define funciones matemáticas que funcionan tanto para reales como números imaginarios.

source: The other escape sequences such as C<\200> and C<\t> and backslashed characters such as C<\\> and C<\-> are replaced with appropriate expansions.
es_es: Las otras secuencias de escape, como C<\200> y C<\t> y caracteres escapados con contrabarras, como C<\\> y C<\->, son reemplazadas con los literales apropiados.

source: If it succeeds it returns true; otherwise it returns false and sets C<$!> (errno).
es_es: Si tiene éxito devuelve verdadero; en caso contrario devuelve falso y asigna C<$!> (errno).

source: C<Dumpvalue> upgraded to version 1.12
es_es: C<Dumpvalue> actualizado a la versión 1.12

source: Some pure-perl code that perl was using to retrieve Unicode properties and transliteration mappings has been reimplemented in XS.
es_es: Algunos códigos escritos en puro perl que se estaban usando para recuperar las propiedades Unicode y las asignaciones de transcripción ha sido reimplementados en XS.

source: =item "STRING"
es_es: =item "CADENA"

source: A regexp in C<STDOUT>'s destructor used to coredump, because the regexp pad was already freed.
es_es: Una expresión regular en el destructor de C<STDOUT> se usa en el volcado del núcleo, ya que la plataforma de expresiones regulares ya fue liberada.

source: # whole record case-insensitively otherwise
es_es: # el registro, independientemente del tamaño de caja

source: If you use a here-doc within a delimited construct, such as in C<s///eg>, the quoted material must come on the lines following the final delimiter.
es_es: Si utiliza un documento incrustado en una construcción delimitada, como en C<s///eg>, el material entrecomillado debe venir en las siguientes líneas al delimitador final.

# printf "I have %d dog%s. ", $n,
source: printf "I have %d dog%s.\n", $n,
es_es: printf "Tengo %d perro%s.\n", $n,

source: Currently you have the choice between ExtUtils::MakeMaker and the more platform independent Module::Build, allowing modules to be installed in a consistent manner.
es_es: Actualmente tiene la posibilidad de elegir entre ExtUtils::MakeMaker y la más independiente de la plataforma, Module::Build, permitiendo módulos que se instalen de una forma coherente.

source: =head3 Switching in a loop
es_es: =head3 Conmutando en un bucle

source: A few general-purpose tools are shipped with perl, mostly because they came along modules included in the perl distribution.
es_es: También se distribuyen con perl algunas herramientas de propósito general, básicamente porque forman parte de módulos incluidos en la distribución de perl.

source: Modifiers that relate to the interpretation of the regular expression inside are listed below.
es_es: Los modificadores que se relacionan con la interpretación de la expresión regular del interior se enumeran a continuación.

source: These modifiers are especially useful given how C<n>, C<N>, C<v>, and C<V> don't cover signed integers, 64-bit integers, or floating-point values.
es_es: Estos modificadores son especialmente útiles dado que C<n>, C<N>, C<v> y C<V> no cubren valores enteros con signo, enteros de 64 bits, o de punto flotante.

source: Documentation clarified and errors corrected.
es_es: Documentación clarificada y errores corregidos.

source: You can only use the triple-dot operator to stand in for a complete statement.
es_es: Sólo se puede utilizar el operador triple punto en lugar de una instrucción completa.

source: If I<not> used in this way, the result of evaluation of C<code> is put into the special variable C<$^R>.
es_es: Si I<no> se usa de esta manera, el resultado de la evaluación de C<código> se pone en la variable especial C<$^R>.

source: $old_filter = $db->filter_fetch_key ( sub { ... } );
es_es: $filtro_antiguo = $db->filter_fetch_key ( sub { ... } );

source: There are a couple of exceptions to the above rule.
es_es: Hay un par de excepciones a la regla anterior.

source: =head2 The Arrow Operator X<arrow> X<dereference> X<< -> >>
es_es: =head2 El operador flecha X<arrow> X<dereference> X<< -> >> X<flecha> X<desreferencia>

source: To email a bug report, send it to bug-E<lt>distribution-nameE<gt>@rt.cpan.org . For example, if you wanted to report a bug in C<Business::ISBN>, you could send a message to bug-Business-ISBN@rt.cpan.org .
es_es: Para notificar un informe de error, envíe un mensaje de correo electrónico a bug-E<lt>nombre-distribuciónE<gt>@rt.cpan.org . Por ejemplo, si desea notificar un error de C<Business::ISBN>, debe enviar un mensaje a bug-Business-ISBN@rt.cpan.org .

source: In particular, contrary to the expectations of shell programmers, back-quotes do I<NOT> interpolate within double quotes, nor do single quotes impede evaluation of variables when used within double quotes.
es_es: En particular, contrariamente a las expectativas de los programadores de shell, las comillas invertidas I<NO> interpolan entre comillas dobles, ni las comillas simples impiden la evaluación de las variables cuando se usan dentro de comillas dobles.

source: For threaded Perls certain system database functions like getpwent() and getgrent() now grow their result buffer dynamically, instead of failing.
es_es: Para Perls con soporte de I<threads>, ciertas funciones de base de datos del sistema como getpwent() y getgrent(), ahora hacen crecer sus búfer de resultados de forma dinámica, en lugar de fallar.

source: was simply wrong because there are no "[] ranges" in tr///.
es_es: simplemente estaba mal, porque no existen "rangos []" en tr///.

source: LINE: while (<STDIN>) {
es_es: LINEA: while (<STDIN>) {

source: use 5.010; # so we can use say()
es_es: use 5.010; # para que podamos usar say()

source: =item Miscellaneous functions
es_es: =item Funciones varias

source: Reading from non-string scalars (like the special variables, see L<perlvar>) now works.
es_es: Leer de escalares que no sean cadenas (como las variables especiales, vea L<perlvar>) ahora funciona.

source: Receive and decode
es_es: Recibir y descodificar

source: Takes extra time to study SCALAR (C<$_> if unspecified) in anticipation of doing many pattern matches on the string before it is next modified.
es_es: Toma tiempo extra para estudiar ESCALAR (C<$_> si no se especifica) en previsión de hacer muchos patrones de coincidencia en la cadena antes de que sea modificada.

source: . string concatenation
es_es: . concatenación de cadenas

source: See L<perlvar/%INC>.
es_es: Ver L<perlvar/%INC>.

source: Other languages have borrowed syntax from Perl, particularly its regular expression extensions.
es_es: Otros lenguajes han tomado prestada la sintaxis de Perl, particularmente sus extensiones de expresiones regulares.

source: See L<perlsymbian> for more information.
es_es: Vea L<perlsymbian> para más información.

source: If OFFSET and LENGTH specify a substring that is partly outside the string, only the part within the string is returned.
es_es: Si DESPLAZAMIENTO y LONGITUD especifican una subcadena que está parcialmente fuera de la cadena, sólo la parte de dentro de la cadena se devuelve.

source: The '$' symbol works semantically like the English word "the" in that it indicates a single value is expected.
es_es: El signo '$' funciona semánticamente como en Español la palabra "el", indicando que se espera un único valor.

source: If most of your users have to type a few almost identical lines of code when they start using your module, it's a sign that you should have made that behaviour a default.
es_es: Si la mayoría de los usuarios tienen que escribir unas pocas líneas casi idénticas de código cuando empiezan a usar su módulo, es una señal de que debería haber hecho este comportamiento por defecto.

source: These various prefixes correspond to the fopen(3) modes of C<r>, C<r+>, C<w>, C<w+>, C<a>, and C<a+>.
es_es: Estos prefijos se corresponden con los modos de la función fopen(3) de C<r>, C<r+>, C<w>, C<w+>, C<a> y C<a+>.

source: $mode = (stat($filename))[2];
es_es: $modo = (stat($archivo))[2];

source: =item exists EXPR X<exists> X<autovivification>
es_es: =item exists EXPR X<exists> X<autovivification> X<autovivificación>

source: =head2 Context X<context> X<scalar context> X<list context>
es_es: =head2 Contexto X<context> X<scalar context> X<list context> X<contexto> X<contexto escalar> X<contexto lista>

source: C<cond_timedwait> has been added.
es_es: Se ha añadido C<cond_timedwait>.

source: The C<next> explicitly iterates the other loop rather than merely terminating the inner one.
es_es: El C<next> explícitamente itera sobre el otro bucle en vez de meramente terminar el interno.

source: There are certain application spaces which are already very, very well served by CPAN.
es_es: Hay ciertos espacios de aplicación que ya están muy, muy bien servidos por CPAN.

source: left << >>
es_es: izquierda << >>

source: C<encoding(utf-8-strict)> with partial characters now works
es_es: C<encoding(utf-8-strict)> ahora funciona con caracteres no completos

source: The C<#> character is also treated as a metacharacter introducing a comment, just as in ordinary Perl code.
es_es: El carácter C<#> también es considerado un metacarácter que antecede a un comentario, al igual que en el código normal de Perl.

source: See L<perlvms/"$?"> for details.
es_es: Vea L<perlvms/"$?"> para los detalles.

source: Something like C<"\Q\\E"> has no C<\E> inside.
es_es: Algo como C<"\Q\\E"> no tiene dentro a C<\E>.

source: The ordering of the matches is the same as for the chosen subexpression.
es_es: El orden de las coincidencias es el mismo que para la subexpresión seleccionada.

source: =head1 FINDING YOUR WAY AROUND
es_es: =head1 ORIENTACIÓN

source: perlbot Perl OO tricks and examples
es_es: perlbot Trucos y ejemplos de POO

source: =head2 Malloc wrapping
es_es: =head2 Envolviendo a Malloc

source: LINE:
es_es: LINEA:

source: \a alarm (bell) (BEL)
es_es: \a alarma (campana) (BEL)

source: His presentation "UTF-8 in the wild" (Dutch Perl Workshop 2006) inspired me to publish my thoughts and write this tutorial.
es_es: Su presentación "UTF-8 in the wild" (Dutch Perl Workshop 2006) me sirvió de inspiración para publicar mis ideas y escribir este tutorial.

source: \L lowercase till \E (think vi)
es_es: \L pasar a minúscula hasta \E (como en vi)

source: s/^\s+//; # trim leading whitespace
es_es: s/^\s+//; # quita los primeros espacios en blanco

source: world";
es_es: a todos";

source: (Under VMS, the variable C<$ENV{SYS$LOGIN}> is also checked, and used if it is set.) If neither is set, C<chdir> does nothing.
es_es: (Bajo VMS, la variable C<$ENV{SYS$LOGIN}> es también comprobada y usada si está puesta). Si ninguna está puesta, C<chdir> no hace nada.

source: STORESIZE this, count
es_es: STORESIZE este, contador

source: C<assertions::compat>, also available on CPAN, allows the use of assertions on perl versions prior to 5.9.0 (that is the first one to natively support them).
es_es: C<assertions::compat>, también disponible en CPAN, permite el uso de aserciones en versiones perl anteriores a 5.9.0 (que fue el primero en soportarlas nativamente).

source: Use of each publically accessible method or subroutine, including parameters and return values
es_es: El uso de cada método o subrutina públicamente accesible, incluidos los parámetros y valores devueltos

source: =head2 Simple Statements X<statement> X<semicolon> X<expression> X<;>
es_es: =head2 Instrucciones simples X<statement> X<semicolon> X<expression> X<;> X<instrucción> X<punto y coma> X<expresión>

source: Optional state for the subroutine.
es_es: Estado opcional para la subrutina.

source: Note however that look-ahead and look-behind are NOT the same thing.
es_es: Tenga en cuenta, sin embargo, que antecedente y consiguiente NO son la misma cosa.

source: given ($something) {
es_es: given ($algo) {

source: One effect of these rules is that -bareword is equivalent to the string "-bareword".
es_es: Uno de los efectos de estas reglas es -palabra es equivalente a la cadena "-palabra".

source: @tmp = somefunc($i);
es_es: @tmp = algunafuncion($i);

source: is semantically equivalent to the list:
es_es: es semánticamente equivalente a la lista:

source: C<File::Basename> upgraded to version 2.74, with changes contributed by Michael Schwern.
es_es: C<File::Basename> actualizado a la versión 2.74, con cambios aportados por Michael Schwern.

source: Unix datagram sockets aren't implemented in Haiku yet.
es_es: Los datagramas sockect Unix aún no están implementados en Haiku.

source: As of Perl 5.11.2 you can use a bare C<readdir> in a C<while> loop, which will set C<$_> on every iteration.
es_es: A partir de Perl 5.11.2 puede usar un simple C<readdir> en un bucle C<while>, que actualizará C<$_> en cada iteración.

source: C<map> is now context aware, and will not construct a list if called in void context.
es_es: C<map> ahora depende del contexto, y no construirá una lista si es llamado en contexto vacío.

source: Be prepared for a wait.
es_es: Prepárese para una espera.

source: This document may be distributed under the same terms as Perl itself.
es_es: Este documento puede ser distribuido bajo los mismos términos que los del propio Perl.

source: <FILEHANDLE> may also be spelled C<readline(*FILEHANDLE)>.
es_es: <IDENTIFICADOR_ARCHIVO> también puede ser escrito como C<readline(*IDENTIFICADOR_ARCHIVO)>.

source: Used as an lvalue, C<keys> allows you to increase the number of hash buckets allocated for the given hash.
es_es: Usado como valor a la izquierda (lvalue), C<keys> le permite incrementar el número de alojamientos de memoria hash para el hash indicado.

source: Perl runs on Windows 95 as well, but it cannot be built there, for lack of a reasonable command interpreter.
es_es: Perl se ejecuta en Windows 95 también, pero no se puede compilar ahí, por falta de un intérprete de comandos razonable.

source: However, this was not true of versions of Perl before 5.004, so if your script will run under older Perl versions, it should call C<srand>; otherwise most programs won't call C<srand()> at all.
es_es: Sin embargo, esto no fue cierto para las versiones de Perl anteriores a la 5.004, así que si su programa se va a ejecutar en versiones anteriores de Perl, debería llamar a C<srand>; de lo contrario, la mayor parte de los programas no llamarán nunca a C<srand>.

source: C<$*>, which was deprecated in favor of the C</s> and C</m> regexp modifiers, has been removed.
es_es: C<$*>, que estaba en desuso en favor de los modificadores de exp. reg. C</s> y C</m>, ha sido eliminada.

source: The most common CPAN version numbering scheme looks like this:
es_es: El esquema de numeración de versiones más común en CPAN es el siguiente:

source: There is no C<systell> function.
es_es: No existe la función C<systell>.

source: See L<perlipc/"Using open() for IPC"> for more examples of this.
es_es: Ver L<perlipc/"Usando open() por IPC"> para más ejemplos de sobre esto.

source: $n = 12.34e-56; # exponential notation
es_es: $n = 12.34e-56; # notación exponencial

source: =item Numeric functions X<numeric> X<number> X<trigonometric> X<trigonometry>
es_es: =item Funciones numéricas X<numeric> X<number> X<trigonometric> X<trigonometry> X<numérico> X<número> X<trigonométrica> X<trigonomía>

source: How come?
es_es: ¿Por qué?

source: The C<code> is not interpolated.
es_es: El C<código> no es interpolado.

source: perl5123delta Perl changes in version 5.12.3
es_es: perl5123delta Cambios en la versión 5.12.3

source: Perl is now known to build again in LynxOS.
es_es: Se sabe que Perl se compila también ahora en LynxOS.

source: redo LINE unless eof(); # not eof(ARGV)!
es_es: redo LINEA unless eof(); # ¡no es eof(ARGV)!

source: Thus C<Z> always packs a trailing null, except when the count is 0.
es_es: Por lo tanto C<Z> siempre empaqueta un valor nulo adicional, excepto cuando el contador es 0.

source: (But see the "\" operator for taking a reference.)
es_es: (Vea, sin embargo, el operador "\" para tomar una referencia).

source: You can't get a list like C<(1,2,3)> into being in scalar context, because the compiler knows the context at compile time.
es_es: No puede conseguir que una lista como C<(1,2,3)> se convierta en contexto escalar porque el compilador conoce el contexto en tiempo de compilación.

source: (Note that this is slightly more flexible than the behavior of some B<tr> programs, which delete anything they find in the SEARCHLIST, period.) If the C</s> modifier is specified, sequences of characters that were transliterated to the same character are squashed down to a single instance of the character.
es_es: (Tenga en cuenta que esto es un poco más flexible que el comportamiento de algunos programas B<tr>, que eliminan todo lo que encuentre en la LISTA_BÚSQUEDA, y punto). Si se especifica el modificador C</s>, las secuencias de caracteres que se transliteren al mismo carácter son reducidos hasta una única instancia del carácter.

source: Invalid [] range "%s" in transliteration operator
es_es: Rango "%s" inválido [] en el operador de transliteración

source: (The syntax descriptions omit the parentheses.) If you use parentheses, the simple but occasionally surprising rule is this: It I<looks> like a function, therefore it I<is> a function, and precedence doesn't matter.
es_es: (Las descripciones sintácticas omiten los paréntesis). Si usa los paréntesis, la simple (pero ocasionalmente sorprendente) regla es esta: Si I<se parece> a una función, por eso I<es> una función y la precedencia no importará.

source: A slice accesses several elements of a list, an array, or a hash simultaneously using a list of subscripts.
es_es: Una porción accede a varios elementos de una lista, un array, o un hash, de forma simultánea, usando una lista de índices.

source: We can manipulate C<@_> in other ways too:
es_es: También podemos manipular C<@_> de otras maneras:

source: This applies equally to method names, parameter names, and anything else which is visible to the user (and most things that aren't!)
es_es: Esto se aplica igualmente a los nombres de los métodos, los nombres de los parámetros, y cualquier otra cosa que sea visible para el usuario (¡y la mayoría de cosas que no lo son!)

source: On error, C<unlink> will not tell you which files it could not remove.
es_es: En caso de error, C<unlink> no indicará qué archivos no se han podido borrar.

source: Consider always blessing objects in CLASSNAMEs that are mixed case.
es_es: Considerar siempre bautizar objetos de NOMBRECLASE que mezcle mayúsculas y minúsculas.

source: -w File is writable by effective uid/gid.
es_es: -w Archivo es escribible por el uid/gid en vigor.

source: perl5130delta - what is new for perl v5.13.0
es_es: perl5130delta - qué hay de nuevo en perl v5.13.0

# print MEMORY "foo! "; # output will appear in $var
source: print MEMORY "foo!\n"; # output will appear in $var
es_es: print MEMORIA "foo!\n"; # la salida aparecerá en $var

source: OpenEdition (UNIX System Services) does not (yet) support the #!
es_es: OpenEdition (UNIX System Services) (aún) no soporta el #!

source: There is now support for Symbian S60 3.2 SDK and S60 5.0 SDK.
es_es: Ahora hay soporte para Symbian S60 3.2 SDK y S60 5.0 SDK.

source: printf '<%#x>', 12; # prints "<0xc>"
es_es: printf '<%#x>', 12; # imprime "<0xc>"

source: Here's another example.
es_es: Aquí hay otro ejemplo:

source: =item Simple matching
es_es: =item Detección de coincidencias sencilla
